变量 线程ID
//从这里开始执行
功能 执行()
    //从这里开始你的代码
    字库设置("rc:tcsoft.txt",0)
    //    变量 ret = 识字(354,833,410,856,"0066cc-050505",0.95)
    //    调试输出(ret)
    //    消息框(ret)
    //    变量 ret2 = 识字ex(1751,321,1798,350 ,"000000-050505",0.95)
    //    调试输出(ret2)
    //    消息框(ret2)
    //    变量 x,y 
    //    变量 ret3 = 找字s(1751,321,1798,350 ,"复选框","000000-050505",0.95, x,y)
    //    调试输出(ret3)
    //    消息框(ret3)
    //    消息框(x)
    //    消息框(y)
    变量 窗口句柄=窗口查找("记事本") 
    
    循环(20)
        //        变量 ret = 识字(547,51,563,90,"02c4f5-0505050",0.95)
        //        调试输出(ret)
        //        变量 ret1 = 识字(1356,658,1384,672,"000000-0505050",0.95)
        //        调试输出(ret1)
        //       
        //		调试输出(窗口句柄)
        //        变量 ret2 = 窗口识字(窗口句柄,414,59,471,83,"02c4f5-0606060",0.95)
        //        调试输出(ret2)
        
        //        变量 ret1= 识字ex(357,865,403,883  ,"0066cc-050505",0.95)
        //        调试输出(ret1)
        //        变量 x,y
        //        变量 ret3 = 找字s(357,865,403,883 ,"返回","0066cc-050505",0.95, x,y)
        //        消息框(ret3)
        //         变量 ret1 = 识字(1656,111,1669,130,"e4ca8e-0505051",0.95)
        //         调试输出(ret1)
        调试输出(窗口句柄)
        //窗口发送按键(窗口句柄,5)
        //        变量 ret2 = 窗口识字(窗口句柄,385,697,433,716,"e4ca8e-0505051",0.60)
        //        调试输出(ret2)
        
    结束
    
    
结束
//启动_热键操作
功能 启动_热键()
    线程ID=线程开启("执行","")
结束

//终止热键操作
功能 终止_热键()
    线程关闭(线程ID)
结束

