function 开始挖宝(窗口句柄)
    
    字库设置("rc:/tc_dict.txt",0)
    
    //    循环(真)
    //        //        变量 ret = 识字(0,0,2000,2000,"f3f3f3-404040",1.0)
    //        //        traceprint(ret)
    //        //        sleep(100)
    //        窗口发送按键(窗口句柄,57)
    //        sleep(300)
    //        
    //        窗口发送按下(窗口句柄,56)
    //        sleep(500)
    //    结束
    var x,y
    dm.FindColor(1048,1,1136,42,"fff229-111111",0.95,0,x,y)
    
    sleep(100)
    dm.MoveTo(x,y)
    sleep(100)
    窗口鼠标左键单击(窗口句柄,x,y)
    sleep(100)
    
    
    
    
    
end

function 自动采集(窗口句柄)
    循环(真)
        
        窗口发送按下(窗口句柄,70)
        sleep(200)
        窗口发送按下(窗口句柄,70)
        sleep(200)
        窗口发送按下(窗口句柄,70)
        sleep(200)
        窗口发送按下(窗口句柄,70)
        sleep(200)
        窗口发送按下(窗口句柄,70)
        sleep(200)
        窗口发送按下(窗口句柄,70)
        sleep(200)
        sleep(3000)
        窗口发送按下(窗口句柄,56)
        sleep(500)
    结束
end